In [1]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [2]:
#for digit grouping and control floating-point numbers

pd.set_option('display.float_format', '{:,.2f}'.format)

In [3]:
df = pd.DataFrame({
    'id' : ['23', '96', '97', '15', '87'],
    'name' : ['computer', 'Python Workout', 'Pandas Workout', 'banana', 'sandwich'],
    'wholesale_price' : [500, 35, 35, 0.5, 3],
    'retail_price' : [1000, 75, 75, 1, 5],
    'sales' : [100, 1000, 500, 200, 300]
})

In [4]:
new_products = pd.DataFrame({
    'id' : ['24', '17', '17'],
    'name' : ['phone', 'apple', 'pear'],
    'wholesale_price' : [200, 0.5, 0.6],
    'retail_price' : [500, 1, 1.2],
    'sales' : [np.nan, np.nan, np.nan]
})

In [5]:
df = pd.concat([df, new_products], ignore_index=True)

df

   id            name  wholesale_price  retail_price    sales
0  23        computer           500.00      1,000.00   100.00
1  96  Python Workout            35.00         75.00 1,000.00
2  97  Pandas Workout            35.00         75.00   500.00
3  15          banana             0.50          1.00   200.00
4  87        sandwich             3.00          5.00   300.00
5  24           phone           200.00        500.00      NaN
6  17           apple             0.50          1.00      NaN
7  17            pear             0.60          1.20      NaN